feat: allow optional for iteration and refresh architecture doc
